app/controllers/comments_controller.rb

	def create
		@problem = Problem.find(params[:problem_id])
		@comment = @problem.comments.create(comment_params)
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("commenter", "body", "problem_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "jon"], ["body", "testing "], ["problem_id", 2], ["created_at", "2016-04-22 21:50:25.101057"], ["updated_at", "2016-04-22 21:50:25.101057"]]

	def destroy
		@problem = Problem.find(params[:problem_id])
		@comment = @problem.comments.find(params[:id])
		@comment.destroy
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."problem_id" = ? AND "comments"."id" = ? LIMIT 1  [["problem_id", 2], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]