app/controllers/problems_controller.rb

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @problem = Problem.find(params[:id])

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @problem = Problem.find(params[:id])

INSERT INTO "problems" ("problem_name", "description", "problem_grade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["problem_name", "Village Idiot"], ["description", "Tall"], ["problem_grade", "V7"], ["created_at", "2016-04-23 04:39:34.387617"], ["updated_at", "2016-04-23 04:39:34.387617"]]
---
  def create
  	@problem = Problem.new(problem_params)

    if @problem.save

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "problems" SET "problem_name" = ?, "problem_grade" = ?, "main_area" = ?, "description" = ?, "updated_at" = ? WHERE "problems"."id" = ?  [["problem_name", "11:11"], ["problem_grade", "V8"], ["main_area", "Radio Towers"], ["description", "Classic."], ["updated_at", "2016-04-26 23:45:19.141970"], ["id", 3]]
---
  def update
    @problem = Problem.find(params[:id])

    if @problem.update(problem_params)

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "problems" WHERE "problems"."id" = ?  [["id", 1]]
---
  def destroy
  	@problem = Problem.find(params[:id])
  	@problem.destroy